In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

In [2]:
mydate = datetime(2022,12,22)

In [3]:
mydate

datetime.datetime(2022, 12, 22, 0, 0)

In [4]:
mydate.hour

0

In [5]:
dates = pd.Series(['Nov 3,1990','2000-02-21',None])

In [6]:
dates

0    Nov 3,1990
1    2000-02-21
2          None
dtype: object

In [7]:
dates[0]

'Nov 3,1990'

In [12]:
pd.to_datetime(dates)[0].year

1990

In [13]:
euro_date = '31-12-2023'

In [14]:
pd.to_datetime(euro_date)

Timestamp('2023-12-31 00:00:00')

In [15]:
euro_date = '10-12-2023'   # dd-mm-yyyy
pd.to_datetime(euro_date)   # ouput should be 2023-12-10 (yyyy-mm-dd)

Timestamp('2023-10-12 00:00:00')

In [18]:
pd.to_datetime(euro_date,dayfirst = True)

Timestamp('2023-12-10 00:00:00')

### Generating the date sequence

In [32]:
dates = pd.date_range(pd.to_datetime('2023-12-01'),periods = 35, freq = 'd' )

In [33]:
dates

DatetimeIndex(['2023-12-01', '2023-12-02', '2023-12-03', '2023-12-04',
               '2023-12-05', '2023-12-06', '2023-12-07', '2023-12-08',
               '2023-12-09', '2023-12-10', '2023-12-11', '2023-12-12',
               '2023-12-13', '2023-12-14', '2023-12-15', '2023-12-16',
               '2023-12-17', '2023-12-18', '2023-12-19', '2023-12-20',
               '2023-12-21', '2023-12-22', '2023-12-23', '2023-12-24',
               '2023-12-25', '2023-12-26', '2023-12-27', '2023-12-28',
               '2023-12-29', '2023-12-30', '2023-12-31', '2024-01-01',
               '2024-01-02', '2024-01-03', '2024-01-04'],
              dtype='datetime64[ns]', freq='D')

In [41]:
dates = pd.date_range(pd.to_datetime('22-12-2023',dayfirst = True), end = 'dec 27, 2023' )

In [42]:
dates

DatetimeIndex(['2023-12-22', '2023-12-23', '2023-12-24', '2023-12-25',
               '2023-12-26', '2023-12-27'],
              dtype='datetime64[ns]', freq='D')

In [48]:
dates = pd.date_range(pd.to_datetime('02-12-2023',dayfirst = True), end = pd.to_datetime('11-12-2023', dayfirst = True))

In [49]:
dates

DatetimeIndex(['2023-12-02', '2023-12-03', '2023-12-04', '2023-12-05',
               '2023-12-06', '2023-12-07', '2023-12-08', '2023-12-09',
               '2023-12-10', '2023-12-11'],
              dtype='datetime64[ns]', freq='D')

### providing custom date format to understand

In [50]:
# used for single value-- not meant for Series/columns
style_date = "12--Dec--2023"
date = datetime.strptime(style_date,"%d--%b--%Y")  
date

datetime.datetime(2023, 12, 12, 0, 0)

In [52]:
# used for large dataset / series/columns
style_date = "12--Dec--2023"
date = pd.to_datetime(style_date,format = "%d--%b--%Y")
date

Timestamp('2023-12-12 00:00:00')

In [8]:
sales = pd.read_csv("../0.datasets/RetailSales_BeerWineLiquor.csv")

In [9]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [11]:
sales['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [14]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [16]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [27]:
sales = pd.read_csv("../0.datasets/RetailSales_BeerWineLiquor.csv",parse_dates = [0])

In [19]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [20]:
sales =sales.set_index('DATE')

In [21]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

## resampling
### df.resample()
A common operation with time series data is resampling based on the time series index. Let's see how to use the resample() method. [reference](#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.resample.html)

When calling .resample() you first need to pass in a rule parameter, then you need to call some sort of aggregation function.

The rule parameter describes the frequency with which to apply the aggregation function (daily, monthly, yearly, etc.)
It is passed in using an "offset alias" - refer to the table below. [reference]

The aggregation function is needed because, due to resampling, we need some sort of mathematical rule to join the rows (mean, sum, count, etc.)

<table style="display: inline-block">
    <caption style="text-align: center"><strong>TIME SERIES OFFSET ALIASES</strong></caption>
<tr><th>ALIAS</th><th>DESCRIPTION</th></tr>
<tr><td>B</td><td>business day frequency</td></tr>
<tr><td>C</td><td>custom business day frequency (experimental)</td></tr>
<tr><td>D</td><td>calendar day frequency</td></tr>
<tr><td>W</td><td>weekly frequency</td></tr>
<tr><td>M</td><td>month end frequency</td></tr>
<tr><td>SM</td><td>semi-month end frequency (15th and end of month)</td></tr>
<tr><td>BM</td><td>business month end frequency</td></tr>
<tr><td>CBM</td><td>custom business month end frequency</td></tr>
<tr><td>MS</td><td>month start frequency</td></tr>
<tr><td>SMS</td><td>semi-month start frequency (1st and 15th)</td></tr>
<tr><td>BMS</td><td>business month start frequency</td></tr>
<tr><td>CBMS</td><td>custom business month start frequency</td></tr>
<tr><td>Q</td><td>quarter end frequency</td></tr>
<tr><td></td><td><font color=white>intentionally left blank</font></td></tr></table>

<table style="display: inline-block; margin-left: 40px">
<caption style="text-align: center"></caption>
<tr><th>ALIAS</th><th>DESCRIPTION</th></tr>
<tr><td>BQ</td><td>business quarter endfrequency</td></tr>
<tr><td>QS</td><td>quarter start frequency</td></tr>
<tr><td>BQS</td><td>business quarter start frequency</td></tr>
<tr><td>A</td><td>year end frequency</td></tr>
<tr><td>BA</td><td>business year end frequency</td></tr>
<tr><td>AS</td><td>year start frequency</td></tr>
<tr><td>BAS</td><td>business year start frequency</td></tr>
<tr><td>BH</td><td>business hour frequency</td></tr>
<tr><td>H</td><td>hourly frequency</td></tr>
<tr><td>T, min</td><td>minutely frequency</td></tr>
<tr><td>S</td><td>secondly frequency</td></tr>
<tr><td>L, ms</td><td>milliseconds</td></tr>
<tr><td>U, us</td><td>microseconds</td></tr>
<tr><td>N</td><td>nanoseconds</td></tr></table>

In [23]:
sales.resample(rule ='AS').mean()

            MRTSSM4453USN
DATE
1992-01-01    1807.250000
1993-01-01    1794.833333
1994-01-01    1841.750000
1995-01-01    1833.916667
1996-01-01    1929.750000
1997-01-01    2006.750000
1998-01-01    2115.166667
1999-01-01    2206.333333
2000-01-01    2375.583333
2001-01-01    2468.416667
2002-01-01    2491.166667
2003-01-01    2539.083333
2004-01-01    2682.416667
2005-01-01    2797.250000
2006-01-01    3001.333333
2007-01-01    3177.333333
2008-01-01    3292.000000
2009-01-01    3353.750000
2010-01-01    3450.083333
2011-01-01    3532.666667
2012-01-01    3697.083333
2013-01-01    3839.666667
2014-01-01    4023.833333
2015-01-01    4212.500000
2016-01-01    4434.416667
2017-01-01    4602.666667
2018-01-01    4830.666667
2019-01-01    4972.750000
2020-01-01    4922.500000

In [24]:
sales

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [28]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [29]:
sales['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int64